function Cards() {
    return (
        <div className="  w-full flex flex-col md:flex-row px-6 md:px-27.5 gap-4 md:gap-8 mt-10.5 pb-6 md:pb-30 bg-[#F9F9F9] pt-10.5 md:pt-30 ">
            <div className="bg-white rounded-2xl px-6 py-8 text-black md:flex-1 md:flex md:flex-col md:gap-5">
                <div className="flex flex-row items-center justify-between">
                    <div className="md:text-[32px] fount-[500] leading-[120%]">Планируйте <br className=" hidden  md:block" /> бюджет дома</div>
                    <div>
                        <svg
                            xmlns="http://www.w3.org/2000/svg"
                            width="56"
                            height="56"
                            viewBox="0 0 56 56"
                            fill="none"
                        >
                            <g clip-path="url(#clip0_356_475)">
                                <circle cx="28" cy="28" r="28" fill="#E8E8E8" />
                                <path
                                    d="M22.5518 16.4561C26.201 15.6715 28.4532 15.6632 32.4482 16.3457C35.6046 16.8881 38.5582 18.3254 39.957 19.2949C40.9981 20.0151 41.8703 20.7797 42.5732 21.8301C43.2614 22.8585 43.7801 24.1527 44.1455 25.9326C45.1175 25.9939 46.2031 26.3145 46.8164 26.791C47.5525 27.3622 48.0034 28.0945 48.1201 28.8242C48.23 29.5118 48.041 30.1911 47.5264 30.7109L47.4199 30.8125C46.7703 31.3932 45.9347 31.4871 45.2041 31.3887C44.6231 31.3104 44.0912 31.1066 43.7393 30.9111C43.709 32.1463 43.7036 33.1089 43.6865 34.1475C43.6761 34.7886 43.1606 35.3066 42.5176 35.3066L42.5186 35.3076C41.0796 35.3118 39.0302 35.3225 37.8428 35.3242C38.4892 36.3656 39.7571 38.3968 40.0361 38.8633H40.0371C40.1801 39.1049 40.2468 39.3335 40.248 39.5293C40.2492 39.7237 40.1848 39.8987 40.0508 40.0049C39.9125 40.1144 39.7308 40.1265 39.5566 40.0537C39.386 39.9823 39.219 39.8299 39.0723 39.6006L39.0713 39.5996C38.6332 38.9055 37.312 36.7597 36.7529 35.877C36.5364 35.5401 36.0106 35.3214 35.4746 35.3213H20.0498C19.8065 35.3213 19.6143 35.3564 19.4541 35.4355C19.2957 35.5138 19.1564 35.6419 19.0273 35.8486L19.0264 35.8496C18.9171 36.0233 18.5378 36.6319 18.0869 37.3584L16.7178 39.5752C16.5662 39.8217 16.3897 39.9899 16.2109 40.0781C16.0329 40.1661 15.8398 40.1791 15.6846 40.0879C15.5271 39.9953 15.4489 39.8188 15.4512 39.6162C15.4535 39.4152 15.5327 39.177 15.6992 38.918C15.9254 38.5662 16.3113 37.9336 16.7451 37.2246C17.1283 36.5985 17.5496 35.9153 17.9287 35.3193C16.3609 35.3002 14.6216 35.3355 13.1982 35.3398H13.1973C12.5509 35.3397 12.0247 34.8166 12.0195 34.1689C12.0113 33.1467 11.9945 31.904 12.0215 30.9531C11.6221 31.1748 11.1121 31.2872 10.6533 31.332C10.369 31.3598 10.0967 31.3638 9.87109 31.3525C9.65015 31.3415 9.4599 31.3147 9.34668 31.2754C8.95953 31.1403 8.58688 30.9104 8.30957 30.5625C8.06583 30.2566 7.90009 29.8656 7.85938 29.3818L7.85059 29.1689C7.8434 28.4398 8.10847 27.7864 8.71582 27.25C9.30372 26.7309 10.2047 26.3284 11.4688 26.0566C12.2094 23.4696 13.4411 22.0127 15.2549 20.1748C16.7177 18.6932 19.014 17.2193 22.5518 16.4561ZM44.6738 27.3301C43.8722 27.1556 43.0361 27.1548 42.5205 27.2949C42.2155 27.3784 41.826 27.559 41.5186 27.9229C41.2131 28.2843 40.9771 28.8415 40.999 29.7021L40.9971 29.7822C40.9827 29.9738 40.9005 30.1978 40.7441 30.3828C40.5839 30.5724 40.3458 30.7206 40.0264 30.7529L39.8838 30.7598C37.8569 30.737 22.5261 30.7734 15.8535 30.7734C15.2412 30.7734 14.7567 30.2749 14.7617 29.6641V29.6631C14.7662 29.2598 14.7348 28.8516 14.6357 28.501C14.5365 28.1498 14.3741 27.8708 14.1279 27.7041C13.7695 27.463 13.071 27.2766 12.2568 27.3027C11.4476 27.3288 10.546 27.5651 9.78223 28.1426C9.40499 28.427 9.19134 28.7907 9.15332 29.1162C9.11641 29.4326 9.24214 29.723 9.57227 29.9023C9.84333 30.05 10.2163 30.0525 10.6787 29.9785C10.9066 29.942 11.1484 29.8883 11.4004 29.8311C11.651 29.7741 11.9125 29.7137 12.1738 29.6641L12.1748 29.6631C12.7605 29.5546 13.2928 30.0119 13.293 30.6045C13.293 31.5166 13.275 32.4713 13.2705 33.2158C13.2667 33.7042 13.6552 34.1005 14.1387 34.1006C18.6855 34.1097 37.0377 34.0905 41.6172 34.0859C42.0969 34.0859 42.4899 33.6899 42.4863 33.207C42.4772 32.3254 42.4772 31.5754 42.5 30.6016V30.6006C42.5162 30.0029 43.0694 29.557 43.6553 29.6875H43.6562C43.8497 29.7314 44.0494 29.7829 44.25 29.835C44.4513 29.8872 44.6538 29.9399 44.8564 29.9873C45.2629 30.0823 45.6618 30.1533 46.0332 30.1533C46.2931 30.1531 46.5425 29.9185 46.668 29.5322C46.7905 29.1547 46.7686 28.6955 46.54 28.3516C46.2049 27.8475 45.4804 27.5057 44.6738 27.3301ZM34.8428 18.3887C31.3131 17.2777 27.5928 17.0421 24.5264 17.4453C20.8651 17.9249 18.1266 19.211 15.5186 21.8457C14.3925 22.9842 13.4505 24.3827 12.8955 26.0732C13.898 26.2071 14.6097 26.4179 15.0938 26.8652C15.6105 27.3429 15.8398 28.0611 15.9385 29.1309V29.1318C15.9593 29.3752 16.1599 29.5604 16.3984 29.5605L27.4297 29.5117C31.4586 29.4963 35.631 29.4886 39.3213 29.5137C39.5632 29.5136 39.7637 29.3272 39.7812 29.0801C39.8486 28.097 40.1228 27.3221 40.6348 26.7871C41.1208 26.2794 41.8032 26.009 42.6719 25.9609C42.6185 24.6115 41.8139 22.8922 40.5146 21.5713C39.8809 20.9267 38.8142 20.2409 37.7217 19.6582C36.6314 19.0766 35.5318 18.6064 34.8428 18.3887Z"
                                    fill="black"
                                    stroke="black"
                                    stroke-width="0.3"
                                />
                            </g>
                            <defs>
                                <clipPath id="clip0_356_475">
                                    <rect width="56" height="56" fill="white" />
                                </clipPath>
                            </defs>
                        </svg>
                    </div>
                </div>
                <div className="md:text-[22px]">
                    Индекс помогает будущим заказчикам рассчитать базовую
                    стоимость дома, отслеживать изменения рынка и&nbsp;принимать
                    осознанные решения при&nbsp;планировании строительства.
                    <br></br>
                    <br></br>
                    Цены указаны для&nbsp;«тёплого контура» (фундамент, стены,
                    кровля, окна), что&nbsp;позволяет оценить стоимость дома
                    в&nbsp;выбранной комплектации, сравнить варианты
                    и&nbsp;спланировать бюджет
                </div>
            </div>
            <div className="bg-[#7DA7A1] rounded-2xl px-6 py-8  md:flex-1 md:flex md:flex-col md:gap-5">
                <div className="flex flex-row items-center justify-between">
                    <div className="md:text-[32px] fount-[500] leading-[120%]">Методика      <br className=" hidden  md:block" />расчёта</div>
                    <div>
                        <svg
                            xmlns="http://www.w3.org/2000/svg"
                            width="56"
                            height="56"
                            viewBox="0 0 56 56"
                            fill="none"
                        >
                            <g clip-path="url(#clip0_356_483)">
                                <circle cx="28" cy="28" r="28" fill="#E8E8E8" />
                                <path
                                    d="M40.9429 42.9998H14.0567C12.921 42.9998 12 42.2037 12 41.2221V12.7778C12 11.7961 12.921 11 14.0567 11H40.9429C42.0786 11 42.9996 11.7961 42.9996 12.7778V41.2221C42.9996 42.2037 42.0786 42.9998 40.9429 42.9998Z"
                                    stroke="black"
                                    stroke-miterlimit="10"
                                    stroke-linejoin="round"
                                />
                                <path
                                    d="M17.5 22C16.6747 22 16 21.3686 16 20.5972V16.4028C16 15.631 16.6751 15 17.5 15C18.3253 15 19 15.6314 19 16.4028V20.5968C19 21.3686 18.3253 22 17.5 22Z"
                                    stroke="black"
                                    stroke-miterlimit="10"
                                    stroke-linejoin="round"
                                />
                                <path
                                    d="M17.5 31C16.6747 31 16 30.3686 16 29.5972V25.4028C16 24.631 16.6751 24 17.5 24C18.3253 24 19 24.6314 19 25.4028V29.5968C19 30.3686 18.3253 31 17.5 31Z"
                                    stroke="black"
                                    stroke-miterlimit="10"
                                    stroke-linejoin="round"
                                />
                                <path
                                    d="M32.5 31C31.6747 31 31 30.3686 31 29.5972V25.4028C31 24.631 31.6751 24 32.5 24C33.3253 24 34 24.6314 34 25.4028V29.5968C34 30.3686 33.3249 31 32.5 31Z"
                                    stroke="black"
                                    stroke-miterlimit="10"
                                    stroke-linejoin="round"
                                />
                                <path
                                    d="M22.5 31C21.6747 31 21 30.3686 21 29.5972V25.4028C21 24.631 21.6751 24 22.5 24C23.3253 24 24 24.6314 24 25.4028V29.5968C24 30.3686 23.3253 31 22.5 31Z"
                                    stroke="black"
                                    stroke-miterlimit="10"
                                    stroke-linejoin="round"
                                />
                                <path
                                    d="M38.5 31C37.6747 31 37 30.3686 37 29.5972V25.4028C37 24.631 37.6751 24 38.5 24C39.3253 24 40 24.6314 40 25.4028V29.5968C40 30.3686 39.3249 31 38.5 31Z"
                                    stroke="black"
                                    stroke-miterlimit="10"
                                    stroke-linejoin="round"
                                />
                                <path
                                    d="M17.5 39C16.6747 39 16 38.3686 16 37.5972V33.4028C16 32.631 16.6751 32 17.5 32C18.3253 32 19 32.6314 19 33.4028V37.5968C19 38.3686 18.3253 39 17.5 39Z"
                                    stroke="black"
                                    stroke-miterlimit="10"
                                    stroke-linejoin="round"
                                />
                                <path
                                    d="M32.5 39C31.6747 39 31 38.3686 31 37.5972V33.4028C31 32.631 31.6751 32 32.5 32C33.3253 32 34 32.6314 34 33.4028V37.5968C34 38.3686 33.3249 39 32.5 39Z"
                                    stroke="black"
                                    stroke-miterlimit="10"
                                    stroke-linejoin="round"
                                />
                                <path
                                    d="M22.5 39C21.6747 39 21 38.3686 21 37.5972V33.4028C21 32.631 21.6751 32 22.5 32C23.3253 32 24 32.6314 24 33.4028V37.5968C24 38.3686 23.3253 39 22.5 39Z"
                                    stroke="black"
                                    stroke-miterlimit="10"
                                    stroke-linejoin="round"
                                />
                                <path
                                    d="M38.5 39C37.6747 39 37 38.3686 37 37.5972V33.4028C37 32.631 37.6751 32 38.5 32C39.3253 32 40 32.6314 40 33.4028V37.5968C40 38.3686 39.3249 39 38.5 39Z"
                                    stroke="black"
                                    stroke-miterlimit="10"
                                    stroke-linejoin="round"
                                />
                                <path
                                    d="M27.5 22C26.6747 22 26 21.3686 26 20.5972V16.4028C26 15.631 26.6751 15 27.5 15C28.3253 15 29 15.6314 29 16.4028V20.5968C29 21.3686 28.3249 22 27.5 22Z"
                                    stroke="black"
                                    stroke-miterlimit="10"
                                    stroke-linejoin="round"
                                />
                                <path
                                    d="M32.5 22C31.6747 22 31 21.3686 31 20.5972V16.4028C31 15.631 31.6751 15 32.5 15C33.3253 15 34 15.6314 34 16.4028V20.5968C34 21.3686 33.3249 22 32.5 22Z"
                                    stroke="black"
                                    stroke-miterlimit="10"
                                    stroke-linejoin="round"
                                />
                                <path
                                    d="M38.5 22C37.6747 22 37 21.3686 37 20.5972V16.4028C37 15.631 37.6751 15 38.5 15C39.3253 15 40 15.6314 40 16.4028V20.5968C40 21.3686 39.3249 22 38.5 22Z"
                                    stroke="black"
                                    stroke-miterlimit="10"
                                    stroke-linejoin="round"
                                />
                                <path
                                    d="M26 19H18"
                                    stroke="black"
                                    stroke-miterlimit="10"
                                    stroke-linejoin="round"
                                />
                                <path
                                    d="M36 19H34"
                                    stroke="black"
                                    stroke-miterlimit="10"
                                    stroke-linejoin="round"
                                />
                                <path
                                    d="M43 19H39"
                                    stroke="black"
                                    stroke-miterlimit="10"
                                    stroke-linejoin="round"
                                />
                                <path
                                    d="M31 19H29"
                                    stroke="black"
                                    stroke-miterlimit="10"
                                    stroke-linejoin="round"
                                />
                                <path
                                    d="M16 19H12"
                                    stroke="black"
                                    stroke-miterlimit="10"
                                    stroke-linejoin="round"
                                />
                                <path
                                    d="M21 27H18"
                                    stroke="black"
                                    stroke-miterlimit="10"
                                    stroke-linejoin="round"
                                />
                                <path
                                    d="M36 27H34"
                                    stroke="black"
                                    stroke-miterlimit="10"
                                    stroke-linejoin="round"
                                />
                                <path
                                    d="M43 27H39"
                                    stroke="black"
                                    stroke-miterlimit="10"
                                    stroke-linejoin="round"
                                />
                                <path
                                    d="M31 27H24"
                                    stroke="black"
                                    stroke-miterlimit="10"
                                    stroke-linejoin="round"
                                />
                                <path
                                    d="M16 27H12"
                                    stroke="black"
                                    stroke-miterlimit="10"
                                    stroke-linejoin="round"
                                />
                                <path
                                    d="M21 35H18"
                                    stroke="black"
                                    stroke-miterlimit="10"
                                    stroke-linejoin="round"
                                />
                                <path
                                    d="M36 35H34"
                                    stroke="black"
                                    stroke-miterlimit="10"
                                    stroke-linejoin="round"
                                />
                                <path
                                    d="M43 35H39"
                                    stroke="black"
                                    stroke-miterlimit="10"
                                    stroke-linejoin="round"
                                />
                                <path
                                    d="M31 35H24"
                                    stroke="black"
                                    stroke-miterlimit="10"
                                    stroke-linejoin="round"
                                />
                                <path
                                    d="M16 35H12"
                                    stroke="black"
                                    stroke-miterlimit="10"
                                    stroke-linejoin="round"
                                />
                                <path
                                    d="M40.9432 11H14.0568C12.921 11 12 11.7039 12 12.5718V13H43V12.5718C43 11.7039 42.079 11 40.9432 11Z"
                                    stroke="black"
                                    stroke-miterlimit="10"
                                    stroke-linejoin="round"
                                />
                                <path
                                    d="M14.0568 43H40.9432C42.079 43 43 42.2961 43 41.4282V41H12V41.4282C12 42.2961 12.921 43 14.0568 43Z"
                                    stroke="black"
                                    stroke-miterlimit="10"
                                    stroke-linejoin="round"
                                />
                            </g>
                            <defs>
                                <clipPath id="clip0_356_483">
                                    <rect width="56" height="56" fill="white" />
                                </clipPath>
                            </defs>
                        </svg>
                    </div>
                </div>
                <div className="md:text-[22px]">
                    Индекс основан на&nbsp;реальных данных: мы&nbsp;детально
                    разбираем типовые дома, учитываем применяемые материалы,
                    прямые цены от&nbsp;поставщиков,
                    а&nbsp;также&nbsp;фактические затраты на&nbsp;работу
                    и&nbsp;логистику.
                    <br></br>
                    <br></br>
                    Все&nbsp;показатели структурированы по&nbsp;типу дома,
                    этажности и&nbsp;сегменту&nbsp;— для&nbsp;удобного
                    и&nbsp;наглядного сравнения.
                </div>
            </div>

            <div className="bg-[url('/images/card.png')] md:bg-[url('/images/cardD.png')] w-full min-h-50 bg-cover rounded-2xl md:flex-1"></div>
        </div>
    );
}

export default Cards;
