function Footer() {
    return (
        <div
            className="pb-12 p-6 text-white flex flex-col bg-[url('/images/footer.png')] bg-cover pt-25  gap-6 
                md:flex-col md:bg-[url('/images/footerD.png')] md:h-127.5
                md:bg-size-[100%_100%] md:bg-center md:bg-no-repeat 
                md:px-15 xl:px-27.5 md:pt-19 md:pb-11 md:justify-between "
        >
            <div className="flex flex-col md:flex-row md:justify-between items-center gap-9">
                <div className="flex flex-col items-center md:items-start gap-9">
                    <svg
                        xmlns="http://www.w3.org/2000/svg"
                        width="213"
                        height="26"
                        viewBox="0 0 213 26"
                        fill="none"
                    >
                        <g clip-path="url(#clip0_367_1522)">
                            <path
                                d="M13 19.8421C16.786 19.8421 19.8421 16.786 19.8421 13C19.8421 9.21404 16.786 6.15789 13 6.15789C11.7988 6.15789 10.6584 6.46197 9.68537 7.00936L11.1602 9.67019C11.7231 9.35831 12.3565 9.19602 13 9.19886C15.0983 9.19886 16.8012 10.9017 16.8012 13C16.8012 15.0983 15.0983 16.8012 13 16.8012C10.9017 16.8012 9.19881 15.0983 9.19881 13C9.19785 12.3083 9.38723 11.6298 9.74617 11.0386L7.13097 9.47253C6.50757 10.5064 6.1579 11.7076 6.1579 13C6.1579 16.786 9.21401 19.8421 13 19.8421ZM13 26C20.1918 26 26 20.1918 26 13C26 5.80819 20.1918 1.08962e-05 13 1.08962e-05C10.7926 -0.00284842 8.62088 0.557083 6.69006 1.62691L8.18009 4.28773C9.59413 3.48188 11.2666 3.04095 13 3.04095C18.5193 3.04095 22.959 7.48068 22.959 13C22.959 18.5193 18.5193 22.9591 13 22.9591C7.4807 22.9591 3.04093 18.5193 3.04093 13C3.04301 11.1891 3.53701 9.41279 4.47017 7.86083L1.85497 6.30996C0.669004 8.25615 0 10.5521 0 13C0 20.1918 5.80818 26 13 26Z"
                                fill="white"
                            />
                            <path
                                d="M199.295 19.7692V6.23076H202.973C207.01 6.23076 209.998 9.16921 209.998 13C209.998 16.8307 207.01 19.7692 202.973 19.7692H199.295ZM196.293 22.6154H202.973C208.662 22.6154 213 18.4 213 13C213 7.58463 208.662 3.38462 202.973 3.38462H196.293V22.6154ZM182.784 20.1538C179.046 20.1538 176.029 16.9538 176.029 13C176.029 9.04617 179.046 5.84615 182.784 5.84615C186.521 5.84615 189.538 9.04617 189.538 13C189.538 16.9538 186.521 20.1538 182.784 20.1538ZM182.784 23C188.173 23 192.541 18.523 192.541 13C192.541 7.46153 188.173 3 182.784 3C177.395 3 173.027 7.47689 173.027 13C173.027 18.523 177.395 23 182.784 23ZM160.268 20.1538C156.53 20.1538 153.513 16.9538 153.513 13C153.513 9.04617 156.53 5.84615 160.268 5.84615C164.006 5.84615 167.023 9.04617 167.023 13C167.023 16.9538 164.006 20.1538 160.268 20.1538ZM160.268 23C165.657 23 170.025 18.523 170.025 13C170.025 7.46153 165.657 3 160.268 3C154.879 3 150.511 7.47689 150.511 13C150.511 18.523 154.879 23 160.268 23ZM103.3 19.7692V6.23076H106.977C111.015 6.23076 114.002 9.16921 114.002 13C114.002 16.8307 111.015 19.7692 106.977 19.7692H103.3ZM100.298 22.6154H106.977C112.667 22.6154 117.005 18.4 117.005 13C117.005 7.58463 112.667 3.38462 106.977 3.38462H100.298V22.6154ZM41.7568 14.4154H48.3765C47.761 17.6923 45.0291 20.1538 41.7568 20.1538C38.0192 20.1538 35.0021 16.9538 35.0021 13C35.0021 9.04617 38.0192 5.84615 41.7568 5.84615C43.7983 5.84615 45.6145 6.79999 46.8604 8.29231L48.9919 6.36922C47.5059 4.4 44.9241 3 41.7568 3C36.3681 3 32 7.47689 32 13C32 18.523 36.3681 23 41.7568 23C47.1456 23 51.5136 18.523 51.5136 13C51.5136 12.4769 51.4686 11.9846 51.3936 11.5692H41.7568V14.4154ZM129.932 22.6154H132.619L136.896 8.70766L141.039 22.6154H143.727L148.98 3.38462H146.173L142.481 17.1077L138.383 3.38462H135.741L131.523 17.1385L127.861 3.38462H124.768L129.932 22.6154ZM86.7885 20.1538C83.0506 20.1538 80.0333 16.9538 80.0333 13C80.0333 9.04617 83.0506 5.84615 86.7885 5.84615C90.5258 5.84615 93.5431 9.04617 93.5431 13C93.5431 16.9538 90.5258 20.1538 86.7885 20.1538ZM86.7885 23C92.1774 23 96.545 18.523 96.545 13C96.545 7.46153 92.1774 3 86.7885 3C81.3996 3 77.0314 7.47689 77.0314 13C77.0314 18.523 81.3996 23 86.7885 23ZM64.2725 20.1538C60.5352 20.1538 57.5179 16.9538 57.5179 13C57.5179 9.04617 60.5352 5.84615 64.2725 5.84615C68.0104 5.84615 71.0271 9.04617 71.0271 13C71.0271 16.9538 68.0104 20.1538 64.2725 20.1538ZM64.2725 23C69.6614 23 74.0295 18.523 74.0295 13C74.0295 7.46153 69.6614 3 64.2725 3C58.8836 3 54.5157 7.47689 54.5157 13C54.5157 18.523 58.8836 23 64.2725 23Z"
                                fill="white"
                            />
                        </g>
                        <defs>
                            <clipPath id="clip0_367_1522">
                                <rect width="213" height="26" fill="white" />
                            </clipPath>
                        </defs>
                    </svg>
                    <div className="flex flex-col gap-3.5 items-center md:items-start">
                        <div className="text-[22px]">КОНТАКТЫ</div>
                        <div className="text-[16px]">8 800 333-11-11</div>
                        <div className="text-[16px]">mail@gwd.ru</div>
                        <div className="text-[16px]">gwd.ru</div>
                    </div>
                </div>
                <div className="flex flex-col items-center md:max-w-118">
                    <div className="text-center md:text-left fount-[500] leading-[120%] text-[16px] uppercase ">
                        Хотите предложить улучшение{" "}
                        <br className="hidden  md:block" />
                        или указать на неточности?{" "}
                        <br className="hidden  md:block" />
                        Напишите нам в Telegram
                    </div>

                    <a target="blank" href="https://t.me/mekto_pm" className="active:translate-y-1 active:shadow-sm transition-all duration-200 group mt-6 relative fount-[500] text-[18px] text-[#00513A] bg-white rounded-full py-3 px-4 w-fit flex gap-2 items-center justify-between cursor-pointer">
                        <div className="ml-5">Предложить улучшение</div>
                        <svg
                            className="fill-[#00533B] group-hover:fill-[#087153] "
                            width="43"
                            height="43"
                            viewBox="0 0 43 43"
                            fill="none"
                        >
                            <g clip-path="url(#clip0_356_558)">
                                <circle
                                    cx="21.5"
                                    cy="21.5"
                                    r="21.5"
                                    
                                />
                                <path
                                    d="M11 21C10.4477 21 10 21.4477 10 22C10 22.5523 10.4477 23 11 23V22V21ZM33.7071 22.7071C34.0976 22.3166 34.0976 21.6834 33.7071 21.2929L27.3431 14.9289C26.9526 14.5384 26.3195 14.5384 25.9289 14.9289C25.5384 15.3195 25.5384 15.9526 25.9289 16.3431L31.5858 22L25.9289 27.6569C25.5384 28.0474 25.5384 28.6805 25.9289 29.0711C26.3195 29.4616 26.9526 29.4616 27.3431 29.0711L33.7071 22.7071ZM11 22V23H33V22V21H11V22Z"
                                    fill="white"
                                />
                            </g>
                            <defs>
                                <clipPath id="clip0_356_558">
                                    <rect width="43" height="43" fill="white" />
                                </clipPath>
                            </defs>
                        </svg>
                    </a>
                </div>
            </div>
            
            
            <div>
                <div className="hidden md:block md:border-b md:border-b-white md:w-full md:mb-4.5" ></div>
                <div className="flex md:flex-row md:justify-between md:items-center">
                <div className="opacity-60 text-white text-center md:text-left font-montserrat text-[18px] font-medium leading-6 underline decoration-solid">
                    
                    Политика конфинденциальности
                    <br className="hidden  md:block" />{" "}
                    Соглашение об обработке и хранении персональных данных
                </div>
                <div className="hidden md:block">2026 г.</div>
            </div>
            </div>
           
        </div>
    );
}

export default Footer;
